---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarShapeEndHookLength
source: html/bfe1d2f5-bd60-ddc3-a047-72343636e264.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarShapeEndHookLength Property

"End Hook Length"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarShapeEndHookLength { get; }
```